PDS/SKS_PDS_Tests/Service References/ShippingService/ShippingService1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://sksPackage.org/2013/ShippingService" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://sksPackage.org/2013/ShippingService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://sksPackage.org/2013/ShippingService/Imports">
      <xsd:import schemaLocation="http://localhost:1416/ShippingService.svc?xsd=xsd0" namespace="http://sksPackage.org/2013/ShippingService" />
      <xsd:import schemaLocation="http://localhost:1416/ShippingService.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
      <xsd:import schemaLocation="http://localhost:1416/ShippingService.svc?xsd=xsd2" namespace="http://schema.sksPackage.org/2013/ShippingService" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="IShippingService_AddPackage_InputMessage">
    <wsdl:part name="parameters" element="tns:AddPackage" />
  </wsdl:message>
  <wsdl:message name="IShippingService_AddPackage_OutputMessage">
    <wsdl:part name="parameters" element="tns:AddPackageResponse" />
  </wsdl:message>
  <wsdl:portType name="IShippingService">
    <wsdl:operation name="AddPackage">
      <wsdl:input wsaw:Action="http://sksPackage.org/2013/ShippingService/AddPackage" message="tns:IShippingService_AddPackage_InputMessage" />
      <wsdl:output wsaw:Action="http://sksPackage.org/2013/ShippingService/AddPackageResponse" message="tns:IShippingService_AddPackage_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
</wsdl:definitions>